/*
 직원 안내 메세지 ----------------------------------------------------------------
*/
public class Emp {
    private String staff;

    public Emp(String staff) {
        this.staff = staff;
    }

    public void empWelcome() {
        System.out.println("\n" +
                " _____         _             _     ___            __  \n" +
                "/  ___|       | |           | |   |_  |         _ \\ \\ \n" +
                "\\ `--.   __ _ | |  __ _   __| |     | |  ___   (_) | |\n" +
                " `--. \\ / _` || | / _` | / _` |     | | / _ \\      | |\n" +
                "/\\__/ /| (_| || || (_| || (_| | /\\__/ /| (_) |  _  | |\n" +
                "\\____/  \\__,_||_| \\__,_| \\__,_| \\____/  \\___/  (_) | |\n" +
                "                                                  /_/ \n");
        /*
        System.out.println(
                "\t         ★☆\n" +
                "\t　　　   ** **\n" +
                "\t　　　 ( ＊ v ＊ )\n" +
                "\t　　 **   ***   **\n" +
                "\t　　 |￣￣￣￣￣￣￣|\n" +
                "\t　　 ＼ ＼ ｜ ／ ／\n" +
                "\t　　　＼＿＿＿＿＿／\t");
        */
        System.out.println("\t" + staff + " 안녕하세요. [샐러드조]입니다.\n\t방문해주셔서 감사합니다.");
    }
}
